## Plan Result (feature-flags-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/106329)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 5 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * aws_rds_cluster_instance.rds_rds-instance_6675FA88
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_rds_cluster.rds_rds_cluster_1A0399FD
  * aws_secretsmanager_secret.rds_rds_secret_A0401B27
  * aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:422" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 0
                  - environment            = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                    ]
                  - essential              = true
                  - healthCheck            = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4242/.well-known/apollo/server-health || exit 1",
                        ]
                      - interval    = 15
                      - retries     = 3
                      - startPeriod = 0
                      - timeout     = 5
                    }
                  - image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/featureflags-prod-app:latest"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group         = "/ecs/FeatureFlags-Prod/app20231129182155361800000004"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "app"
                  - portMappings           = [
                      - {
                          - containerPort = 4242
                          - hostPort      = 4242
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "AUTH_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:authorizationURL::"
                        },
                      - {
                          - name      = "CALLBACK_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:callbackURL::"
                        },
                      - {
                          - name      = "CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:clientId::"
                        },
                      - {
                          - name      = "CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:clientSecret::"
                        },
                      - {
                          - name      = "DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:host::"
                        },
                      - {
                          - name      = "DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:dbname::"
                        },
                      - {
                          - name      = "DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:password::"
                        },
                      - {
                          - name      = "DB_PORT"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:port::"
                        },
                      - {
                          - name      = "DB_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:username::"
                        },
                      - {
                          - name      = "ISSUER_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:issuer::"
                        },
                      - {
                          - name      = "SENTRY_DSN"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/FeatureFlags/Prod/SENTRY_DSN"
                        },
                      - {
                          - name      = "TOKEN_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:tokenURL::"
                        },
                      - {
                          - name      = "USER_INFO_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:userInfoURL::"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--region",
                      - "us-east-1",
                      - "--local-mode",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-xray-daemon"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group         = "/ecs/FeatureFlags-Prod/xray-daemon20231129182155361100000003"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "xray-daemon"
                  - portMappings           = [
                      - {
                          - containerPort = 2000
                          - hostPort      = 2000
                          - protocol      = "udp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "FeatureFlags-Prod" -> (known after apply)
      ~ revision                 = 422 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "FeatureFlags"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_rds_cluster.rds_rds_cluster_1A0399FD must be replaced
-/+ resource "aws_rds_cluster" "rds_rds_cluster_1A0399FD" {
      ~ allocated_storage                   = 1 -> (known after apply)
      + apply_immediately                   = (known after apply)
      ~ arn                                 = "arn:aws:rds:us-east-1:996905175585:cluster:featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p" -> (known after apply)
      ~ availability_zones                  = [
          - "us-east-1a",
          - "us-east-1c",
          - "us-east-1e",
        ] -> (known after apply)
      - backtrack_window                    = 0 -> null
      ~ backup_retention_period             = 1 -> (known after apply)
      ~ cluster_identifier                  = "featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p" -> (known after apply)
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-M2W7JDZGAEEESDFK36TX4RTWBQ" -> (known after apply)
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql11" -> (known after apply)
      + db_system_id                        = (known after apply)
      - deletion_protection                 = false -> null
      + enable_local_write_forwarding       = false
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p.cluster-cnjorcjciimm.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_mode                         = "serverless" -> "provisioned" # forces replacement
      ~ engine_version                      = "11.21" -> "16.1"
      ~ engine_version_actual               = "11.21" -> (known after apply)
      ~ hosted_zone_id                      = "Z2R2ITUGPM61AM" -> (known after apply)
      - iam_database_authentication_enabled = false -> null
      ~ iam_roles                           = [] -> (known after apply)
      ~ id                                  = "featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p" -> (known after apply)
      - iops                                = 0 -> null
      ~ kms_key_id                          = "arn:aws:kms:us-east-1:996905175585:key/8382501e-7042-461e-9de2-95737c0987f5" -> (known after apply)
      ~ master_password                     = (sensitive value)
      ~ master_user_secret                  = [] -> (known after apply)
      + master_user_secret_kms_key_id       = (known after apply)
      ~ master_username                     = "pkt_featureflags" -> "pkt_fflags"
      ~ network_type                        = "IPV4" -> (known after apply)
      ~ port                                = 5432 -> (known after apply)
      ~ preferred_backup_window             = "03:00-05:00" -> (known after apply)
      ~ preferred_maintenance_window        = "fri:10:18-fri:10:48" -> (known after apply)
      + reader_endpoint                     = (known after apply)
      ~ storage_encrypted                   = true -> (known after apply)
      + storage_type                        = (known after apply)
        tags                                = {
            "environment" = "Prod"
            "service"     = "FeatureFlags"
        }
        # (10 unchanged attributes hidden)

      - scaling_configuration {
          - auto_pause               = false -> null
          - max_capacity             = 16 -> null
          - min_capacity             = 2 -> null
          - seconds_until_auto_pause = 300 -> null
          - timeout_action           = "RollbackCapacityChange" -> null
        }

      + serverlessv2_scaling_configuration {
          + max_capacity = 16
          + min_capacity = 2
        }
    }

  # aws_rds_cluster_instance.rds_rds-instance_6675FA88 will be created
  + resource "aws_rds_cluster_instance" "rds_rds-instance_6675FA88" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "16.1"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = (known after apply)
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)
    }

  # aws_secretsmanager_secret.rds_rds_secret_A0401B27 must be replaced
-/+ resource "aws_secretsmanager_secret" "rds_rds_secret_A0401B27" {
      ~ arn                            = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc" -> (known after apply)
      ~ description                    = "Secret For featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc" -> (known after apply)
      ~ name                           = "FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p" # forces replacement -> (known after apply) # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "FeatureFlags"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1 must be replaced
-/+ resource "aws_secretsmanager_secret_version" "rds_rds_secret_version_11D8C2B1" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc|BC822229-0BA1-4296-B6C3-495194935BB1" -> (known after apply)
      ~ secret_id      = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc" # forces replacement -> (known after apply) # forces replacement
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "BC822229-0BA1-4296-B6C3-495194935BB1" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
    }

Plan: 5 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:422" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"509bfc28-47ec-4a53-b8c4-034fdac05f6c","JobName":"feature-flags_infrastructure_plan_prod","PRNumber":358,"Program":"tfcmt","SHA1":"479fcd1f23f3ed10dee89894715214f1c1dccb0c","Target":"feature-flags-cdk","Vars":{}} -->